import { useState } from "react";
import Carousel from "react-bootstrap/Carousel";
import img from "../../assets/banner.jpg";
import "./Carousel.css";
import NewsCard from "../Card";

function ControlledCarousel() {
  const [index, setIndex] = useState(0);

  const handleSelect = (selectedIndex) => {
    setIndex(selectedIndex);
  };
  const article = {
    headline: `పర్మినెంట్‌ సిబ్బంది కుదింపు`,
    img: "https://prajasakti.com/sites/default/files/2023-11/Council_0.jpg",
    timespan: "Nov 06,2023 11:05",
    article: ` తాత్కాలిక సిబ్బంది నియామకాలు అంతంతమాత్రం
    లేబర్‌ మార్కెట్‌లో స్తబ్ధత శ్రీ ఎన్‌సిఎఇఆర్‌ సర్వే వెల్లడి
   న్యూఢిల్లీ :   గత 6 నెలల్లో శాశ్వత సిబ్బందిని నియమించుకునే సంస్థలు సగానికి తగ్గాయని, పోనీ తాత్కాలిక నియామకాలు పెరిగాయా అంటే అదీ లేదనినేషనల్‌ కౌన్సిల్‌ ఆఫ్‌ అప్లైడ్‌ ఎకనామిక్‌ రీసెర్చ్‌ (ఎన్‌సిఎఇఆర్‌) సర్వే స్పష్టం చేసింది. ఏప్రిల్‌-జూన్‌ త్రైమాసికంలో శాశ్వత పోస్టులకు రిక్రూట్‌మెంట్‌ను పెంచాలని 30.9 శాతం సంస్థలు యోచించగా, జూలై-సెప్టెంబర్‌ త్రైమాసికంలో ఇటువంటి సంస్థలు15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగుల నియామకాలు ఈ కాలంలో 45 శాతం నుంచి 35.6 శాతానికి పడిపోయాయని ఎన్‌సిఎఇఆర్‌) తెలిపింది. లేబర్‌ మార్కెట్‌లో సంక్షోభం తీవ్రతను ఇది తెలియజేస్తోంది. వచ్చే 6 నెలల్లో జాబ్‌ మార్కెట్‌ పరిస్థితిలో పెద్దగా మార్పు ఉండకపోవచ్చని విశ్లేషకులు అభిప్రాయపడుతున్నారు. సంఘటిత రంగంలో కొత్త రిక్రూట్‌మెంట్‌కు అవకాశాలు తగ్గిపోయాయి.. 83.9 శాతం సంస్థల్లో పర్మినెంట్‌ పోస్టుల భర్తీ చేసే జాడ ఎక్కడా కనిపించడం లేదు. అక్టోబర్‌లో సేవల రంగ వద్ధి మందగించిందని ఎస్‌అండ్‌పి గ్లోబల్‌ సర్వే ఇదివరకే వెల్లడించింది. అక్టోబరు 31 నాటికి ముగిసిన త్రైమాసికంలో కొత్త ఉద్యోగాల కల్పన కనిష్ట స్థాయికి పడిపోయింది. ఎన్‌సిఎఇఆర్‌ సర్వే ప్రకారం, సెప్టెంబర్‌ త్రైమాసికంలో తాత్కాలిక ఉద్యోగుల సంఖ్యను పెంచాలని యోచిస్తున్న సంస్థలను వేళ్లమీద లెక్కించవచ్చు. ఎన్‌సిఎఇఆర్‌ 126వ రౌండ్‌ సర్వే సెప్టెంబర్‌లో నిర్వహించారు. ఈ పరిశోధనా సంస్థ మొత్తం 500 కంపెనీలను సర్వే చేసింది. నైపుణ్యం కలిగిన కార్మికుల రిక్రూట్‌మెంట్‌ను పెంచడానికి కంపెనీలు పెద్దగా ఆసక్తి చూపడం లేదని సర్వే వెల్లడించింది. ఈ సర్వేపై సిపిఐ(ఎం) ప్రధాన కార్యదర్శి సీతారాం ఏచూరి స్పందిస్తూ, ''కేవలం 3 నెలల్లో, శాశ్వత సిబ్బందిని పెంచుకోవాలని చూస్తున్న కంపెనీలు 30.9 శాతం నుండి 15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగులను నియమించుకోవాలని చూస్తున్న కంపెనీలు కూడా వెనకడుగు వేస్తున్నాయి. 'మోడినామిక్స్‌' వల్ల ప్రజల ఆదాయాలు దిగజారుతున్నాయి. దీంతో డిమాండ్‌ పడిపోతుంది. అంతిమంగా అది ఆర్థిక వ్యవస్థ కుప్పకూలేందుకు దారి తీస్తుంది'' అని అన్నారు. ప్రధానమంత్రి నరేంద్ర మోదీ వివిధ సందర్భాల్లో భారత దేశ ఆర్థిక వ్యవస్థ భేషుగ్గా ఉందని డాంబికాలు పోతున్నారు. ఆయన చేస్తున్న ప్రకటనలకు, వాస్తవ ఆర్థిక వ్యవస్థ ముఖచిత్రం పూర్తి భిన్నంగా ఉందని ఏచూరి పేర్కొన్నారు. మోదీ చేపట్టిన 'మేక్‌ ఇన్‌ ఇండియా' కార్యక్రమం ఓ ప్రహసనంగా మారిందన్నారు.`,
  };
  const data = [
    {
      headline: `ఎనిమిదోరోజు ప్రజా రక్షణ భేరి ఫొటోలు`,
      img: "https://prajasakti.com/sites/default/files/2023-11/Israel_0.jpg",
      timespan: "Nov 06,2023 10:56",
      article: `సిపిఎం పార్టీ 'ప్రజా రక్షణ భేరి' యాత్రను చేపట్టంది. అసమానతలు లేని అభివృద్ధి కోసం చేపట్టిన ఈ యాత్ర అక్టోబర్‌ 30వ తేదీన రెండు బస్సు జాతాలు ప్రారంభమయ్యాయి. ఆదోని నుండి ఒక జాతా, పార్వతీపురం సీతానగరం నుండి మరోజాతా ప్రారంభమైంది. ఆదోని నుండి ప్రారంభమైన బస్సు యాత్ర సోమవారానికి నెల్లూరుకి చేరుకుంది. సీతానగరం నుండి ప్రారంభమైన బస్సు యాత్ర ఈరోజు ఉదయానికి కుకునూరు చేరుకుంది. ఆ తర్వాత వేలేరుపాడు మండలానికి చేరుకుంది. ఈ యాత్రలకు సంబంధించిన ఫొటోలు.. వేలేరుపాడు మండలానిరకి చేరుకున్న 'ప్రజా రక్షణ భేరి' యాత్ర
        `,
    },
    {
      headline: `గాజాను రెండుగా విభజించిన ఇజ్రాయిల్‌ సైన్యం దాడులు ఉధృతం`,
      img: "https://prajasakti.com/sites/default/files/2023-11/anil%20kumar%20adoni%20copy_0.jpg",
      timespan: "Nov 06,2023 11:4",
      article: `టెల్‌ అవీవ్‌ : అమెరికా, ఇతర పశ్చిమ దేశాల మద్దతుతో గాజాలో ఇజ్రాయిల్‌ మారణహోమం సృష్టిస్తోంది. ఇజ్రాయిల్ సైన్యం  గాజా సిటీని చుట్టుముట్టడంతో పాటు .. గాజా ను ఉత్తర గాజా, దక్షిణ గాజా అని రెండు భాగాలుగా విభజించింది. ''గాజా నగరాన్ని మేం చుట్టుముట్టాం. ఇప్పుడు ఇక ఉత్తర గాజా, దక్షిణ గాజాగా విభజించాం. ఈ యుద్ధంలో ఇది చాలా ముఖ్యమైన దశ. మేం మరింత కీలకంగా దాడులు చేయబోతున్నాం'' అని ఇజ్రాయెల్‌ ఆర్మీ అధికార ప్రతినిధి డేనియల్‌ హగారీ మీడియాకు వెల్లడించారు. బందీలను వదిలిపెట్టేవరకు కాల్పుల విరమణ ప్రస్తావన ఉండదని ఇజ్రాయిల్‌ ప్రధాని బెంజిమిన్‌ నెతన్యాహూ ప్రకటించారు. గెలిచే వరకు యుద్ధం కొనసాగిస్తామని, మాకు మరోమార్గం లేదని మరోసారి స్పష్టం చేశారు. 

      పాలస్తీనా అధ్యక్షుడు మహ్మద్‌ అబ్బాస్‌తో అమెరికా విదేశాంగ మంత్రి ఆంటోని బ్లింకెన్‌ ఆదివారం సమావైశమైన సంగతి తెలిసిందే. పాలస్తీనా సమస్యకు సమగ్ర పరిష్కారం చూపితే, గాజాలోను పాలస్తీనా అథారిటీ అధికారంలోకి తిరిగి రాగలదని అబ్బాస్‌ బ్లింకెన్‌తో అన్నట్లు రాయిటర్‌ వార్తా సంస్థ తెలిపింది. గాజా సంధి కుదుర్చుకోవాలని అరబ్‌ నాయకులతో కలసి అబ్బాస్‌ అమెరికాను కోరినట్లు తెలుస్తోంది. ఆంటోనీ బ్లింకెన్‌ పర్యటన అనంతరం ఈ కీలక పరిణామం చోటు చేసుకోవడం గమనార్హం.
          `,
    },
    {
      headline: `దేశాన్ని అమ్మే హక్కు మోడీకి ఎవరిచ్చారు ప్రజారక్ష ణభేరిలో కె లోకనాథం`,
      img: "https://prajasakti.com/sites/default/files/2023-11/rakshana%20bheri_0.jpg",
      timespan: "Nov 06,2023 11:29",
      article: `ప్రజాశక్తి - గ్రేటర్‌ విశాఖ బ్యూరో/కాకినాడ ప్రతినిధి : దేశంలోని బ్యాంకులు, రైల్వేలు, పోర్టులు, ఎయిర్‌పోర్టులు, గాలి, నీరు.. ఇలా దేశం మొత్తాన్ని అదానీ. అంబానీ వంటి కార్పొరేట్లకు అమ్మే హక్కు ప్రధాని మోడీకి ఎవరిచ్చారని సిపిఎం రాష్ట్ర కార్యదర్శివర్గ సభ్యులు కె.లోకనాథం ప్రశ్నించారు. బిజెపితో ప్రజలకు తీవ్ర నష్టం కలుగుతోందన్నారు. సిపిఎం ఆధ్వర్యాన జరుగుతున్న ప్రజారక్షణ భేరి బస్సు యాత్ర ఆదివారం అనకాపల్లి జిల్లా లంకెలపాలెంలో ప్రారంభమై పరవాడ, అచ్యుతాపురం, అనకాపల్లి, ఎస్‌.రాయవరం, మీదుగా కాకినాడ జిల్లా తుని, పిఠాపురం, కాకినాడకు చేరుకుంది. యాత్రా బృందానికి స్థానికంగా ఏళ్ల తరబడి ఎదుర్కొంటున్న ఫార్మా కాలుష్యంపైనా, కనీస సదుపాయాలలేమిపైనా, విద్యుత్‌ భారాలపైనా వినతులు సమర్పించారు. యాత్ర ఆద్యంతం ఆశాలు, అంగన్‌వాడీలు, విఒఎలు, మధ్యాహ్న భోజన కార్మికులు, జీడి పిక్కల పరిశ్రమ కార్మికులు, ఇతర స్కీం వర్కర్లు పెద్ద సంఖ్యలో పాల్గొన్నారు. ఆయా చోట్ల ఏర్పాటు చేసిన సభల్లో కె.లోకనాథం మాట్లాడుతూ రాజ్యాంగ స్ఫూర్తికి విరుద్ధంగా కేంద్రంలో మోడీ పాలన సాగుతోందన్నారు. రాష్ట్రాలు, ప్రాంతాల మధ్యే కాకుండా మత సామరస్యంతో జీవించే మనుషుల మధ్య కూడా చిచ్చుపెడుతోందని తెలిపారు.
      విభజన హామీలను నెరవేర్చకున్నా, నిత్యావసర సరుకుల ధరలను పెంచేస్తున్నా రాష్ట్రంలోని వైసిపి, టిడిపి, జనసేన పార్టీలు ప్రశ్నించకపోవడం దారుణమన్నారు. పరవాడ రాంకీ ఫార్మా కంపెనీ కాలుష్యంతో స్థానిక ప్రజల ఉపాధికి తీవ్ర విఘాతం కలుగుతోందన్నారు. కాలుష్యంతో పరవాడలోని పెదచెరువు ఎలా నాచు పట్టికుపోయిందో వివరించారు. పరవాడ వాసులు కాలుష్యంతో జీవిస్తున్నా రాష్ట్ర ప్రభుత్వానికి పట్టదా? అని ప్రశ్నించారు. కేంద్ర, రాష్ట్ర ప్రభుత్వాలు కాకినాడ వంటి నగరాల్లో పట్టణ సంస్కరణలను అమలు చేస్తూ.. చెత్త, ఇంటి పన్నులు భారీగా పెంచి ప్రజలపై మోయలేని భారాలను మోపుతున్నాయన్నారు. కాకినాడ నగరంలో పాలకులు భూ కబ్జాలు చేస్తున్నారని విమర్శించారు. జూనియర్‌ కళాశాల స్థలాన్ని కబ్జా చేసే ప్రయత్నం చేస్తున్నారని తెలిపారు. లౌకికవాదం, ప్రజాస్వామ్య పరిరక్షణ, అసమానతలు లేని అభివృద్ధి కోసమే యాత్రలు చేపట్టినట్లు తెలిపారు. లంకెలపాలెం జంక్షన్‌ వద్ద సభలో పార్టీ సీనియర్‌ నాయకులు సిహెచ్‌.నర్సింగరావు మాట్లాడుతూ రాంకీపై చర్యలు తీసుకోకపోవడం వెనుక ప్రధాన రాజకీయ పార్టీలకు చెందిన నాయకులందరికీ రూ.లక్షలు లంచాలు కవర్లలో అందడమే కారణమని విమర్శించారు. పార్టీ రాష్ట్ర కార్యదర్శివర్గ సభ్యులు మంతెన సీతారాం మాట్లాడుతూ.. కార్పొరేట్లకు తొత్తుగా వ్యవహరిస్తోన్న బిజెపితో వైసిపి, టిడిపి, జనసేన పార్టీలు జతకట్టడం సరికాదన్నారు. బిజెపి అనుసరిస్తోన్న ప్రజా వ్యతిరేక విధానాలను ప్రతి ఒక్కరూ వ్యతిరేకించాలని కోరారు. యాత్రలో సిపిఎం రాష్ట్ర నాయకులు ఎవి.నాగేశ్వరరావు, కె.ధనలక్ష్మి, బి.ప్రభావతి, హరిబాబు, అనకాపల్లి జిల్లా కార్యదర్శివర్గ సభ్యులు జి.కోటేశ్వరరావు, డి.వెంకన్న, ఎం.అప్పలరాజు, సిపిఎం కాకినాడ జిల్లా కన్వీనర్‌ ఎం.రాజశేఖర్‌, సీనియర్‌ నాయకులు దువ్వాశేషబాబ్జి, జి.బేబిరాణి తదితరులు పాల్గొన్నారు.
          `,
    },
    {
      headline: `విజయవాడ బస్టాండ్‌లో ప్రమాదానికి ప్రభుత్వానిదే పూర్తి బాధ్యత`,
      img: "https://prajasakti.com/sites/default/files/2023-11/lokesh_0.jpg",
      timespan: "Nov 06,2023 11:21",
      article: `అమరావతి : విజయవాడ బస్టాండ్‌లో జరిగిన ప్రమాదానికి ప్రభుత్వమే పూర్తిగా బాధ్యత వహించాలని టిడిపి జాతీయ ప్రధాన కార్యదర్శి లోకేశ్‌ అన్నారు. సోమవారం ఉదయం విజయవాడ బస్టాండ్‌లో ఆర్‌టిసి బస్సు బ్రేకులు ఫెయిల్‌ అవ్వడంతో ప్లాట్‌ ఫాం పైకి దూసుకెళ్లింది. ఈ ప్రమాదంలో ముగ్గురు మృతి చెందారు. ఈ ఘటనపై నారా లోకేశ్‌ స్పందించారు. విజయవాడ బస్టాండులో జరిగిన ప్రమాదం బాధాకరమన్నారు. ఈ ఘటనకు ప్రభుత్వమే పూర్తిగా బాధ్యత వహించాలని అన్నారు. కాలం చెల్లిన బస్సుల కారణంగానే రాష్ట్రంలో తరచూ ప్రమాదాలు సంభవిస్తున్నాయని, వైసిపి ప్రభుత్వం అధికారంలోకి వచ్చాక ఒక్క కొత్త బస్సు కూడా కొనుగోలు చేయలేదని విమర్శించారు. నాలుగున్నరేళ్లుగా ఆర్‌టిసి గ్యారేజీల్లో నట్లు, బోల్టులు కొనుగోలుకు కూడా ప్రభుత్వం నిధులివ్వడం లేదని ఆరోపించారు.
          `,
    },
    {
      headline: `క్రిమినల్‌ చట్టాలను మార్చే బిల్లుల  ముసాయిదా నివేదికలు నేడు ఆమోదం..!`,
      img: "https://prajasakti.com/sites/default/files/2023-11/bill_0.jpg",
      timespan: "Nov 06,2023 11:20",
      article: ` హోంస్టాండింగ్‌ కమిటీ భేటీ
      కమిటీ మరింత విస్తృతంగా పరిశీలించడానికి ప్యానెల్‌ కోసం పొడిగించాలి : ప్రతిపక్ష సభ్యుల డిమాండ్‌
     ప్రజాశక్తి-న్యూఢిల్లీ బ్యూరో :  ప్రస్తుత మూడు క్రిమినల్‌ చట్టాలను మార్చుతూ తీసుకొచ్చిన మూడు బిల్లులను పరిశీలించిన హోం పార్లమెంటరీ స్టాండింగ్‌ కమిటీ ముసాయిదా నివేదికలను స్వీకరించడానికి సోమవారం సమావేశం కానుంది. కొంతమంది ప్రతిపక్ష సభ్యులు ఈ చర్యలను మరింత విస్తృతంగా పరిశీలించడానికి ప్యానెల్‌కు మరింత సమయం ఇవ్వాలని కోరారు. అక్టోబరు 27న హోంస్టాండింగ్‌ కమిటీ మూడు ముసాయిదా నివేదికలను అధ్యయనం చేయడానికి మరికొంత సమయం కావాలని ప్రతిపక్ష సభ్యులు ఒత్తిడి చేయడంతో వాటిని ఆమోదించలేకపోయింది. కొంతమంది ప్రతిపక్ష సభ్యులు ప్యానెల్‌ ఛైర్‌పర్సన్‌ బ్రిజ్‌లాల్‌ పదవీకాలాన్ని మూడు నెలలు పొడిగించాలని, స్వల్పకాలిక ఎన్నికల లాభం కోసం ఈ బిల్లులను బుల్డోజ్‌ చేయడం ఆపాలని కోరారు. అట్టడుగు వర్గాలకు సేవ చేసే పటిష్టమైన చట్టాన్ని రూపొందించడానికి, కమిటీ తదుపరి కొన్ని రోజుల్లో లేదా నవంబరులో తుది నివేదికను ఆమోదించకూడదని సభ్యులు కోరారు. అలా చేస్తే చట్టసభల పరిశీలన ప్రక్రియను అపహాస్యం చేసినట్లు అవుతుందని ప్రతిపక్ష వర్గాలు తెలిపాయి. కమిటీ విస్తృతమైన సంప్రదింపుల ప్రక్రియలో నిమగమైందని, మూడు నెలల గడువును పూర్తి చేస్తుందని బిజెపి వర్గాలు తెలిపాయి. మూడు ముసాయిదాలను ఆమోదించడానికి సభ్యులకు పంపిన నోటీసు ప్రకారం, కమిటీ నవంబరు 6న సమావేశమవనుంది. ప్రతిపక్ష పార్టీలకు చెందిన కొంతమంది సభ్యులు వ్యతిరేకిస్తున్నప్పటికీ ప్యానెల్‌ ముసాయిదా నివేదికలను ఆమోదించవచ్చని వర్గాలు తెలిపాయి. వలస పాలన నాటి క్రిమినల్‌ చట్టాలను పూర్తిగా సవరించాలని కోరుతూ, హోంమంత్రి అమిత్‌షా వర్షాకాల సెషన్‌లో ఇండియన్‌ పీనల్‌ కోడ్‌ (ఐపిసి), క్రిమినల్‌ ప్రొసీజర్‌ కోడ్‌-1973, ఇండియన్‌ ఎవిడెన్స్‌ యాక్ట్‌-1872 స్థానంలో భారతీయ న్యాయ సంహిత, భారతీయ నాగరిక్‌ సురక్ష సంహిత, భారతీయ సాక్ష్యా అధినియంతో కూడిన మూడు బిల్లులను లోక్‌సభలో ప్రవేశపెట్టారు. ఆగస్టు 11న బిల్లులు ప్రవేశపెట్టిన తర్వాత వాటిని కమిటీ పరిశీలనకు పంపి మూడు నెలల్లోగా నివేదిక సమర్పించాలని లోక్‌సభ కోరింది. కమిటీ మూడు బిల్లుల్లో సవరణల సిఫార్సు చేసే అవకాశం ఉందని, అయితే వాటి హిందీ పేర్లకు కట్టుబడి ఉంటుందని, డిఎంకెతో సహా ప్రతిపక్ష ఎంపిలు తీవ్రంగా వ్యతిరేకిస్తున్నాయని ఆయా వర్గాలు తెలిపాయి. ప్రతిపాదిత చట్టాలకు ఆంగ్ల పేర్లను కూడా ఇవ్వాలని డిమాండ్‌ చేశారు.
          `,
    },
    {
      headline: `ప్రజా రక్షణ భేరి : వేలేరుపాడు మండలం (లైవ్‌)`,
      img: "https://prajasakti.com/sites/default/files/2023-11/live%202%20copy_0.jpg",
      timespan: "Nov 06,2023 11:17",
      article: `సిపిఎం పార్టీ చేపట్టిన 'ప్రజా రక్షణ భేరి' యాత్ర సోమవారానికి వేలేరుపాడుకి చేరుకుంది. అక్టోబర్‌ 30వ తేదీ పార్వతీపురం సీతానగరం నుండి ప్రారంభమైన ఈ బస్సు యాత్ర సోమవారం ఉదయానికి కుకునూరుకి చేరుకుంది. అక్కడ నుండి వేలేరుపాడు మండలానికి చేరింది. ఈరోజు అక్కడ బహిరంగ సభ జరగనుంది. ఈ సభలో సిపిఎం రాష్ట్ర కార్యదర్శి వి. శ్రీనివాసరావు మాట్లాడనున్నారు. ఈ సభ (లైవ్‌).
          `,
    },
  ];
  return (
    <div className="carousel-container">
      <Carousel activeIndex={index} onSelect={handleSelect}>
        <Carousel.Item>
          <div className="newsCard-container">
            <div className="big-card">
              <NewsCard size={"big"} article={article} />
            </div>
            <div className="small-cards">
              {data?.map((item, id) => (
                <div key={id}>
                  <NewsCard size={"small"} article={item} />
                </div>
              ))}
            </div>
          </div>
        </Carousel.Item>
        <Carousel.Item>
          <div className="newsCard-container">
            <div className="big-card">
              <NewsCard size={"big"} article={article} />
            </div>
            <div className="small-cards">
              {data?.map((item, id) => (
                <div key={id}>
                  <NewsCard size={"small"} article={item} />
                </div>
              ))}
            </div>
          </div>
        </Carousel.Item>
        <Carousel.Item>
          <div className="newsCard-container">
            <div className="big-card">
              <NewsCard size={"big"} article={article} />
            </div>
            <div className="small-cards">
              {data?.map((item, id) => (
                <div key={id}>
                  <NewsCard size={"small"} article={item} />
                </div>
              ))}
            </div>
          </div>
        </Carousel.Item>
      </Carousel>
    </div>
  );
}

export default ControlledCarousel;
